# NotSplitValidRegions Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SplitSketchBasedElementFailures..::..NotSplitValidRegions Property
BuiltInFailures..::..SplitSketchBasedElementFailures Class See Also
---
The split failed. There may be a gap in the boundary loop or the sketch may be incomplete.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NotSplitValidRegions { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NotSplitValidRegions As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NotSplitValidRegions {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SplitSketchBasedElementFailures Class
Autodesk.Revit.DB Namespace